ワークフローとアーキテクチャをMermaid記法に変更
